# DWFExportOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DWFExportOptions Properties
DWFExportOptions Class See Also
---
The DWFExportOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CropBoxVisible | Whether to export crop box. |
| ExportingAreas | Whether to also export areas and rooms' geometry. |
| ExportObjectData | Whether to include properties associated with elements. |
| ExportOnlyViewId | Only export the specified view. |
| ExportTexture | Whether to export texture. |
| ImageFormat | Controls the compression level of images embedded. |
| ImageQuality | Image quality level when compressed raster format(JPEG) is used. |
| MergedViews | Whether to merge all views in one file. |
| PaperFormat | Standard paper format. |
| PortraitLayout | Paper orientation - Portrait/Landscape. |
| StopOnError | Whether export process should stop when a view fails to export. |

# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace